# Level 8:
# 1) ვისწავლეთ:
# integer
# string
# float
# boolean
# თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები (ანუ: integer - 5, 10, 15...)

# 2) ახსენით რა არის კონკატენაცია (concatenation)
# 3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში
# 4) კომენტარის სახით დაწერეთ პასუხი: როგორ უნდა შევამოწმო რა ტიპის არის ჩემი ცვლადი
# 5) რა არის explicit და implicit conversion'ები
# 6) ჩამოწერეთ რა შედარების ოპერატორი იცით მათემატიკაში

# 2. კონკატენაცია არის სტრინგების შეერთება
# 3. ბრჭყალებში ჩასმულ რიცხვებს სტრინგებად თვლის და რიცხვების ჯამის მაგივრად კონკატენაცია გამოდის
# 4. უნდა გამოვიყენოთ ფუნქცია: type
# 5. explicit = ფუნქცია რომელსაც ჩვენ ვქმნით. implicit = ფუნქცია რომელიც უკვე შექმნილია python-ის მიერ და ვერ ვხედავთ კოდს შიგნით
# 6. მეტობა, ტოლობა, მეტია-ან-ტოლია, ნაკლებია-ან-ტოლია, ტოლია