#Page_Layout რომ დავგეგმოთ და ვიზუალურად გავაუმჯობესოდ ან შევქმნათ ვებგვერდის სტრუქტურა
#header  ვებგვერდის ან სექციის ზედა ნაწილისთვის სადაც შეიძლება იყოს ლოგო ნავიგაცია ან სათაური
#nav ნავიგაციის სექცია სადაც განთავსებულია ბმულებს და სხვაჰ
#main წარმოადგენს გვერდის მტავარ შინაარსს და მხოლოდ ერთჯერ უნდა იყოს გამოყენებული თითო გვერდზე
#section ?
#article ბლოგების და არტიკლების დასაწერად ინფორმაციახე
#aside გვერდზე განგალებისთვის მაგალითად დამატებითი ინფორმაცია რეკლამები ან ბმულები
#footer განთავსებულია გვერდის ქვედა ნაწილში, სადაც შეიძლება იყოს საკონტაქტო ინფორმაცია ან კოპირაიტის ტექსტი და სხვა
#style attribute რომ CSS დავაკავშიროთ html- თან და ტექსტს შევუცვალოთ ფერი ან სტილი, ან გავადიდოთ
#div თეგი გამოიყენება html -ში რომ დააჯგუფოს სხვა ელემენტები და შექმნას განყოფილებები/ადგილები ვებგვერდის სტრუქტურაში
#6,7 ?