// 1. ორივეში key და value შეგიძლიათ იხმაროთ მაგრამ python-ის dictionary-ში key შეიძლება იყოს სტრინგი ინტი ტუპლი ჯავასკრიპტის ობჯექტში მარტო სტრინგი ან სიმბოლო
const person = {
  name: "Anna",
  age: 25,
  hello: function () {
    console.log("hello");
  },
};
// 3. ფუნქცია არ არის მაინცდამაინც დაკავშირებული ერთ ობიექტთან, და ყოველ კონტექსტში შეიძლება გამოიყენებოდეს,
//  ასევე ფუნქციას იყენებ მისი სახელით. მეთოდი ყოველ ობიექტს ეკუთვნის, "This" სჭირდება რომ კავშირი ჰქონდს ობიექტის სხვა თვისებებზე,
//  გამოყენებაში თითქმის იგივეა მაგრამ წერტილი სჭირდება სანამ გამოიძახებ.
